#define  _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>


//int main() {
//	double a = 5 / 2.0;//商2余1
//	printf("a=%lf\n", a);
//
//	return 0;
//}


//移位符只能用在整数
//int main() {
//	
//	//>>-- 右移操作符
//	//移动的是二进制位
//	//00000000000000000000000000010000 
//	// 1，算术右移(通常）
//	// 右边丢弃，左边补原符号位，右移一位有除二的效果
//	// 2，逻辑右移
//	// 右边丢弃，左边补0
//	//-- 1：2的四次方
//	// 
//	// 
//	// 
//	int a = -1;
//	//整数的二进制表示有：原码，反码，补码
//	//储存到内存的是补码
//	//10000000000000000000000000000001 -- 源码
//	//11111111111111111111111111111110 -- 反码
//	//11111111111111111111111111111111 -- 补码
//	int b= a >> 1;
//	printf("%d\n", b);
//	return 0; 
//}

//int main() {
//	int a = 5;
//	int b = a << 1;
//	//00000000000000000000000000000101
//	//左移操作符：左边丢弃，右边补0
//	printf("%d\n", b);
//	return 0;
//}

//int main() {
//	//& --按二进制位 与
//	//int a = 3;
//	//int b = 5;
//	//int c = a & b;
//	//000000000000000000000000000000011
//	//000000000000000000000000000000101
//	//000000000000000000000000000000001
//	//printf("%d\n", c);
//	// 
//	// 
//	//| --按二进制位 或
//	//int a = 3;
//	//int b = 5;
//	//int c = a | b;
//	//printf("%d\n", c);
//	//000000000000000000000000000000011
//	//000000000000000000000000000000101
//	//000000000000000000000000000000111
//
//	//^ 按二进制位异或
//	//相同为0，相异为1
//	int a = 3;
//	int b = 5;
//	int c = a ^ b;
//	printf("%d\n", c);
//	//000000000000000000000000000000011
//	//000000000000000000000000000000101
//	//000000000000000000000000000000110
//	return 0;
//}


////互换数
//int main() {
//	int a = 3;
//	int b = 5;
////	//int tmp = 0;//临时变量
////	printf("before:a=%d b=%d\n", a, b);
////	/*tmp = a;
////	a = b;
////	b = tmp;*/
//
//	//加减法(不用tmp临时变量）--可能会溢出
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//
//	//异或的方法
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//
//
//	printf("after:a=%d b=%d\n", a, b);
//	return 0;
//}

//数二进制中的1的个数
//int main() {
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);//
//	//统计num的补码中二进制1的个数
//	while (num) {
//		if (num % 2 == 1) 
//			count++;
//			num = num / 2;
//		
//		
//	 }
//	printf("%d\n", count);
//	return 0;
//}
//负数没法算


//int main() {
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);
//	int i = 0;
//	for (i = 0; i < 32; i++) {
//		if(1 == ((num >> i) & 1))
//		count++;
//	}
//	printf("%d\n", count);
//}


//赋值操作符
//int main() {
//	int a = 10;
//	a = a + 2;
//	a += 2;//复合赋值符
//
//	a = a >> 1;
//	a >>= 1;
//
//	a = a & 1;
//	a &= 1;
//
//	return 0;
//}

//单目操作符
//a+b +是双目操作符
//单目操作符--只有一个操作符

//int main() {
//	int a = 0;
//	/*if (a) {
//		printf("hehe\n");
//	}*/
//	if (!a) {
//		printf("hehe\n");
//	}
//	/*printf("%d\n",!a);*/
//}

//int main() {
//	int a = -5;
//	a = -a;
//	printf("%d", a);
//	return 0;
//}

//取地址操作符
//int main() {
//	int a = 10;
//	int* p = &a;//取地址操作符,p为执政变量
//	*p=20;//解引用操作符 --通过
//	printf("%d\n", a);
//	return 0;
//}

//sizeof
//求xx的大小
int main() {
	int a = 20;
	char c = 'r';
	char* p = &c;
	int arr[10] = { 0 };
	//sizeof计算的变量所占内存空间的大小，单位是字节
	printf("%d\n", sizeof(a));//4
	printf("%d\n", sizeof(int));

	printf("%d\n", sizeof(c));//1个字符
	printf("%d\n", sizeof(char));

	printf("%d\n", sizeof(p));//8、4
	printf("%d\n", sizeof(char*));

	printf("%d\n", sizeof(arr));//40
	printf("%d\n", sizeof(int [10]));
}